<?php
$_['text_error_req']        ="الحقل %s يجب أن يحتوي على قيمة";
$_['text_error_num']        ="الحقل %s يجب ان يكون رقم ";
$_['text_error_int']        ="الحقل %s يجب ان يكون رقم صحيح";
$_['text_error_float']      ="الحقل %s يجب ان يكون رقم عشري ";
$_['text_error_alpha']      =" الحقل %s يجب ان يحتوي على احرف فقط ";
$_['text_error_alphanum']   ="  الحقل %s يجب ان يحتوي على احرف ارقام  ";
$_['text_error_lt']         =" s% الحقل يجب ان يكون اقل";
$_['text_error_gt']         ="s% الحقل  يجب ان يكون اكثر s%";
$_['text_error_min']        ="الحقل %s عدد أحرف أقل من المطلوب  %s (احرف ان كان نصيا)";
$_['text_error_max']        ="الحقل %s عدد أحرف اكثر من المطلوب  %s   (احرف ان كان نصيا)";
$_['text_error_between']    =" الحقل %s يجب ان تكون قيمته ما بين  %s و %s  (احرف ان كان نصيا)";
$_['text_error_floatlike']  =" الحقل %s يجب ان يكون عشري مكون من %s رقم قبل العلامه و %s  رقم بعد العلامه";
$_['text_error_vdate']      =" الحقل %s يجب ان يكون التاريخ بتنسيق YYYY-mm-dd ";
$_['text_error_email']      =" الحقل %s يجب ان يكون بريد الكتروني ex:someone@gmail.com";
$_['text_error_url']        =" الحقل %s يجب ان يكون رابط صحيح ex:http://www.url.com";
